# Core utilities
brew 'git'
brew 'wget'
brew 'coreutils'
brew 'direnv'

# Language support
brew 'go'
brew 'node'
brew 'python@3.8', link: true, overwrite: true
brew 'shellcheck'
brew 'yarn'
brew 'nginx'
brew 'java'

# Dev Setup
tap 'neovim/neovim'
tap 'pivotal/tap'
tap 'universal-ctags/universal-ctags'
brew 'lastpass-cli'
brew 'neovim'
brew 'tmux'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'z'
cask 'flycut'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'spectacle'

# Extras
tap 'homebrew/cask-fonts'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'tldr'
brew 'the_platinum_searcher'
brew 'watch'
cask 'zoom'
